In [103]:
# import streamlit as st
# import pydeck as pdk
# import pandas as pd
# import numpy as np
# import matplotlib
# import matplotlib.pyplot as plt
# import seaborn as sns
# from tqdm import tqdm

# file_path = './data/groupby_lat_dong_23년12월렌탈.csv'
# df_rent_sum = pd.read_csv(file_path)
# df_rent_sum['기준_날짜'] = df_rent_sum['기준_날짜'].astype('str')
# df_rent_sum_date = df_rent_sum
# df_rent_sum_date.set_index('기준_날짜', inplace=True)



# top_ranking = df_rent_sum_date['20231201':'20231202'].groupby(by=['시작_대여소_동명'])\
#         .agg({'전체_건수':sum,'전체_이용_분':sum,'전체_이용_거리':sum})\
#         .sort_values(by=['전체_이용_거리','전체_이용_분','전체_건수'],ascending=False)
# top_ranking.reset_index(inplace=True)    
top_ranking.iloc[:5,:]['시작_대여소_동명'].values[0]
cond = top_ranking.iloc[:5,:]['시작_대여소_동명'].values

cond_TN = (df_rent_sum_date['20231201':'20231202']['시작_대여소_동명']=='가양1동') |\
          (df_rent_sum_date['20231201':'20231202']['시작_대여소_동명']=='여의동') |\
          (df_rent_sum_date['20231201':'20231202']['시작_대여소_동명']=='목1동') |\
          (df_rent_sum_date['20231201':'20231202']['시작_대여소_동명']=='발산1동') |\
          (df_rent_sum_date['20231201':'20231202']['시작_대여소_동명']=='방화1동')

df_map_top = df_rent_sum_date['20231201':'20231202'].loc[cond_TN,['시작_대여소_lat','시작_대여소_lon']].drop_duplicates()
df_map_top.rename(columns={'시작_대여소_lat':'lat','시작_대여소_lon':'lon'},inplace=True)
df_map_top
# df_rent_sum_date['20231201':'20231202'].loc[:,['시작_대여소_lat','시작_대여소_lon']]
# top_ranking.loc[:,['시작_대여소_lat','시작_대여소_lon']]
# top_ranking

                lat         lon
기준_날짜
20231201  37.529900  126.876541
20231201  37.530251  126.879303
20231201  37.560207  126.824142
20231201  37.558311  126.826523
20231201  37.558949  126.837173
...             ...         ...
20231201  37.527157  126.931900
20231201  37.572563  126.816422
20231201  37.552914  126.836571
20231201  37.567284  126.818275
20231201  37.529163  126.872749

[151 rows x 2 columns]

In [71]:
sdate = '2023-12-01'
print(sdate.replace('-',''))

20231201

In [ ]:
# 수집된 정보 데이터 프레임 출력
df_rent_tot = df_rent.loc[cond,['기준_날짜','시작_대여소_동명','시작_대여소명','종료_대여소명','전체_건수','전체_이용_분','전체_이용_거리']]\
        .sort_values(by=['기준_날짜','시작_대여소_동명','시작_대여소명','종료_대여소명'])


# 차트를 출력하기 위해 동별 goupby
df_rent_tot_group = df_rent_tot.groupby(by=['기준_날짜','시작_대여소_동명','시작_대여소명'])\
        .agg({'전체_건수':sum,'전체_이용_분':sum,'전체_이용_거리':sum})\
        .sort_values(by=['전체_건수','전체_이용_분','전체_이용_거리'],ascending=False)

In [24]:
cond = (df_master1['대여소_ID']=='ST-1000')
df_master1.loc[cond,:]

      index   대여소_ID                주소1          주소2       lat         lon
3190   3267  ST-1000  서울특별시 양천구 신정동 236  서부식자재마트 건너편  37.51038  126.866798

In [31]:
# df_master1.sort_values('대여소_ID',ascending=False)
# df_master1['대여소_ID'].value_counts() : 3193
# df_rent1['시작_대여소_ID'].value_counts()

ST-2031    2353
ST-1718    1357
ST-2045    1217
ST-1065    1170
ST-413     1142
           ...
ST-939        2
ST-2665       2
ST-1953       2
ST-1601       2
ST-380        2
Name: 시작_대여소_ID, Length: 2722, dtype: int64

In [11]:
df_master1[df_master1['대여소_ID'].duplicated()]

Empty DataFrame
Columns: [index, 대여소_ID, 주소1, 주소2, lat, lon]
Index: []

In [ ]:
cond = (df_rent['시작_대여소_동명']=='신정3동')
df_rent.loc[cond,'시작_대여소_ID'].value_counts()